#!/usr/bin/env ruby
tap "homebrew/aliases"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "microsoft/git"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Formatter/translator for text files to numerous formats
brew "asciidoc"
# Text processor and publishing toolchain for AsciiDoc
brew "asciidoctor"
# Source code beautifier for C, C++, C#, and Java
brew "astyle"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash", args: ["HEAD"]
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash Automated Testing System
brew "bats-core"
# Arbitrary precision numeric processing language
brew "bc"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Python code formatter
brew "black"
# Fish completion for brew-cask
brew "brew-cask-completion"
# Vector graphics library with cross-device output support
brew "cairo"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Checks for bashisms in shell scripts
brew "checkbashisms"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Dependency Manager for PHP
brew "composer"
# Utility that creates projects from templates
brew "cookiecutter"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Static analysis of C and C++ code
brew "cppcheck"
# Static code checker for C++
brew "cpplint"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# POSIX-compliant descendant of NetBSD's ash (the Almquist SHell)
brew "dash", args: ["HEAD"]
# File comparison utilities
brew "diffutils"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Generate documentation for several programming languages
brew "doxygen"
# Friendly and expressive shell
brew "elvish"
# AST-based pattern checker for JavaScript
brew "eslint"
# Command-line tool to interact with exercism.io
brew "exercism"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Identify or delete duplicate files
brew "fdupes"
# Utility to determine file types
brew "file-formula"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Lint your Python code for style and logical errors
brew "flake8"
# Examines code and reports possible security weaknesses
brew "flawfinder"
# Software library to render fonts
brew "freetype"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# Bash completion for gem
brew "gem-completion"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git", args: ["HEAD"]
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Audit git repos for secrets
brew "gitleaks"
# Multi-platform library for OpenGL applications
brew "glfw"
# Core application library for C
brew "glib"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# GNU grep, egrep and fgrep
brew "grep"
# Perceptual JPEG encoder
brew "guetzli"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Website copier/offline browser
brew "httrack"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Integer Set Library for the polyhedral model
brew "isl"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# KornShell, ksh93
brew "ksh"
# Pager program similar to more
brew "less", args: ["HEAD"]
# Multi-format archive and compression library
brew "libarchive"
# Portable Foreign Function Interface library
brew "libffi"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# X.509 and CMS library
brew "libksba"
# Implementation of the file(1) command
brew "libmagic"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# Library for manipulating PNG images
brew "libpng"
# TIFF library and utilities
brew "libtiff"
# Generic library support script
brew "libtool"
# YAML Parser
brew "libyaml"
# Next-gen compiler infrastructure
brew "llvm"
# Text-based web browser
brew "lynx"
# Keep your Mac's application settings in sync
brew "mackup", args: ["HEAD"]
# Move files and folders to the trash
brew "macos-trash"
# Utility for directing compilation
brew "make"
# Unix documentation system
brew "man-db"
# UNIX manpage compiler toolset
brew "mandoc"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Fast and user friendly build system
brew "meson"
# MirBSD Korn Shell
brew "mksh"
# Generate Objective-C & Swift classes from your Core Data model
brew "mogenerator"
# C library for multiple-precision floating-point computations
brew "mpfr"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Text-based UI library
brew "ncurses"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Platform built on V8 to build network applications
brew "node"
# Adds an OCR text layer to scanned PDF files
brew "ocrmypdf"
# Bash-compatible Unix shell with more consistent syntax and semantics
brew "oil"
# Portable OpenBSD ksh, based on the public domain Korn shell (pdksh)
brew "oksh"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Outputs current CPU temperature for OSX
brew "osx-cpu-temp"
# Package manager in the style of Arch's pacman
brew "pacapt"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Highly capable, feature-rich programming language
brew "perl"
# General-purpose scripting language
brew "php"
# Tool to automatically fix PHP coding standards issues
brew "php-cs-fixer"
# Bash completion for Pip
brew "pip-completion"
# Manage compile and link flags for libraries
brew "pkg-config"
# Optimizer for PNG files
brew "pngcrush"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Policy-compliant ordinary shell
brew "posh"
# PHP Static Analysis Tool
brew "psalm"
# It's not just a linter that annoys you!
brew "pylint"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Ruby version manager
brew "rbenv"
# Implementation of the AT&T Plan 9 shell
brew "rc"
# Library for command-line editing
brew "readline"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Install various Ruby versions and implementations
brew "ruby-build"
# Bash completion for Ruby
brew "ruby-completion"
# Small man page generator
brew "scdoc"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck", args: ["HEAD"]
# Bash syntax highlighter that encourages/fixes variables quoting
brew "shellharden"
# Autoformat shell script source code
brew "shfmt", args: ["HEAD"]
# Python 2 and 3 compatibility utilities
brew "six"
# Command-line interface for SQLite
brew "sqlite"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id", link: true
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Swift code generator for assets, storyboards, Localizable.strings, …
brew "swiftgen"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Enhanced, fully compatible version of the Berkeley C shell
brew "tcsh"
# Official documentation format of the GNU project
brew "texinfo"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# Instant terminal sharing
brew "tmate"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Ultra fast grep with query UI, fuzzy search, archive search, and more
brew "ugrep"
# Source code beautifier
brew "uncrustify"
# Vi 'workalike' with many additional features
brew "vim"
# Pager/text based browser
brew "w3m"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Internet file retriever
brew "wget"
# Lookup tool for domain names and other internet resources
brew "whois", link: true
# General-purpose data compression with high compression ratio
brew "xz"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Yet another shell: a POSIX-compliant command-line shell
brew "yash"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh", args: ["HEAD"]
# Tips, tricks, and examples for zsh
brew "zsh-lovers"
# Voice and text chat software
cask "discord-canary"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Sci-fi themed terminal emulator and system monitor
cask "edex-ui"
cask "git-credential-manager-core"
# Client for the Google Drive storage service
cask "google-drive"
# Virtual globe
cask "google-earth-pro"
# For browsing, enhancing and converting images
cask "graphicconverter"
# Open-source video transcoder
cask "handbrake"
# Hex editor focussing on speed
cask "hex-fiend"
# Vector graphics editor
cask "inkscape"
# File archiver
cask "keka"
# Clipboard manager
cask "maccy"
# File system integration
cask "macfuse"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Music tagger
cask "musicbrainz-picard"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# QuickLook plugin for plaintext files without an extension
cask "qlstephen"
# QuickLook generator for video files
cask "qlvideo"
# QuickLook plugin for JSON files
cask "quicklook-json"
# QuickLook generator for Adobe Swatch Exchange files
cask "quicklookase"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Instant messaging application focusing on security
cask "signal"
# Application for inspecting installer packages
cask "suspicious-package"
# Messaging app with a focus on speed and security
cask "telegram"
# Web browser focusing on security
cask "tor-browser-alpha"
# Open-source BitTorrent client
cask "transmission-nightly"
# Virtualizer for x86 hardware
cask "virtualbox"
# Extend the functionality of VirtualBox
cask "virtualbox-extension-pack"
# Open-source cross-platform multimedia player
cask "vlc-nightly"
cask "webpquicklook"
# Torrent streaming application
cask "webtorrent"
# Desktop client for WhatsApp
cask "whatsapp-beta"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Video communication and virtual meeting platform
cask "zoom-for-it-admins"
